---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.MetalReductionFactor
source: html/1847428a-9248-defe-3050-5b1829583f61.htm
---
# Autodesk.Revit.DB.StructuralAsset.MetalReductionFactor Property

The reduction factor of the asset.

## Syntax (C#)
```csharp
public double MetalReductionFactor { get; set; }
```

## Remarks
Applies to Metal-based structural assets.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - When setting this property: the material type must be Metal to set this property.